```
krishna@turbotindias-MacBook-Pro aws_vpc_unallocated_ip_approved_usage % terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.awx_vpc_elastic_ip_approved will be created
  + resource "turbot_policy_setting" "awx_vpc_elastic_ip_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-vpc-internet#/policy/types/elasticIpApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.awx_vpc_elastic_ip_approved_usage will be created
  + resource "turbot_policy_setting" "awx_vpc_elastic_ip_approved_usage" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<~EOT
              {% set has_cross_account = false -%}
              {% if $.AssociationId == null %}
              'Not approved'
              {% else %}
              'Approved'
              {% endif %}
        EOT
      + template_input               = <<~EOT
              {
                resources {
                  metadata {
                    stats {
                      total
                    }
                  }
                  items {
                    PublicIp: get(path: "PublicIp")
                    AllocationId: get(path: "AllocationId")
                    AssociationId: get(path: "AssociationId")
                    turbot {
                      akas
                    }
                  }
                }
              }
        EOT
      + type                         = "tmod:@turbot/aws-vpc-internet#/policy/types/elasticIpApprovedUsage"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.aws_vpc_elastic_ip will be created
  + resource "turbot_smart_folder" "aws_vpc_elastic_ip" {
      + description = "Restrict Unassociated EIPS"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "AWS VPC Unassociated EIPs"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.aws_vpc_elastic_ip: Creating...
turbot_smart_folder.aws_vpc_elastic_ip: Creation complete after 3s [id=217048781949649]
turbot_policy_setting.awx_vpc_elastic_ip_approved: Creating...
turbot_policy_setting.awx_vpc_elastic_ip_approved_usage: Creating...
turbot_policy_setting.awx_vpc_elastic_ip_approved_usage: Creation complete after 1s [id=217048784683734]
turbot_policy_setting.awx_vpc_elastic_ip_approved: Creation complete after 1s [id=217048784853723]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.